# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и выводит название этого дня
def task1():
    week = int(input("Введите номер недели: "))
    if week == 1:
        print("Понедельник")
    elif week == 2:
        print("Вторник")
    elif week == 3:
        print("Среда")
    elif week == 4:
        print("Четверг")
    elif week == 5:
        print("Пятница")
    elif week == 6:
        print("Суббота")
    elif week == 7:
        print("Воскресенье")
    else:
        print("Нет такого дня")

# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве
def task2():
    x1 = int(input("Введите координату x1: "))
    x2 = int(input("Введите координату x2: "))
    y1 = int(input("Введите координату y1: "))
    y2 = int(input("Введите координату y2: "))

    result = ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
    print(f"Расстояние между двумя точками A(x1, y1) и B(x2, y2) равно: {result:.2f}")

# Напишите программу, которая по заданному номеру четверти показывает диапозон возможных координат точек в этой четверти
def task3():
    quarter = int(input("Введите номер координатной четверти: "))
    if 0 < quarter < 5:
        if   quarter == 1: result = "x > 0, y > 0"
        elif quarter == 2: result = "x < 0, y > 0"
        elif quarter == 3: result = "x < 0, y < 0"
        else:              result = "x > 0, y < 0"
        print(f"Диапозон возможных значений: {result}")
    else:
        print(f"Координатной четверти с номером {quarter} не существует")

# Напишите программу, которая на вход принимает число N, а на выходе показывает все чётные числа от 1 до N
def task4():
    n = int(input("Введите число: "))
    print(list(range(2, n + 1, 2) if n > 0 else range(-2, n - 1, -2)))