# Напишите программу, которая на вход принимает число и выдаёт его квадрат (число, умноженное само на себя)
def task1():
    number = int(input("Введите число: "))
    print(f"Квадрат числа {number} равен {number ** 2}")

# Напишите программу, которая на вход принимает два числа и проверяет, является ли второе число квадратом первого
def task2():
    a = int(input("Введите первое число: "))
    b = int(input("Введите второе число: "))

    result = "является" if a ** 2 == b else "не является"
    print(f"Число {b} {result} квадратом числа {a}")

# Организуйте последовательный ввод чисел до тех пор, пока не будет введен 0. Подсчитайте среди введенных чисел те, которые кратны трем
def task3():
    lst = []
    flag = True
    count = 0

    while flag:
        a = int(input("Введите число: "))
        if a == 0: flag = False
        else:
            lst.append(a)
            if a % 3 == 0:
                count += 1

    print(f"Введенные числа: {lst}")
    print(f"Кол-во чисел кратных трем: {count}")

# Напишите программу, которая будет на вход принимать число N и выводить числа от -N до N
def task4():
    N = int(input("Введите число: "))
    lst = list(range(-N, N - 1, -1) if N < 0 else range(-N, N + 1))
    print(lst)

# Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа
def task5():
    f = float(input("Введите дробное число: "))
    print("нет" if f == 0 or f % int(f) == 0 else int(f * 10) % 10)

# Напишите программу, которая находит наибольшее и наименьшее число из списка значений
def task6():
    import random
    lst = [random.randint(0, 100) for i in range(0, 10)]
    print(f"Сгенерированный список: {lst}")
    print(f"Максимальное число: {max(lst)}\nМинимальное число: {min(lst)}")