# С помощью анонимной функции найдите в списке на 15 элементов числа, кратные 5
# Заполните список случайным образом числами от 1 до 100
def task0():
    from random import randint
    lst = [randint(0, 101) for _ in range(15)]
    print(lst)
    print(list(filter(lambda x: x % 5 == 0, lst)))

# На вход подаётся четырёхзначное число. Получите список, состоящий из цифр данного числа, увеличенных на 10
def task1():
    n = "9650"
    lst = list(map(lambda x: int(x) + 10, n))
    print(lst)

# В зоопарк отправили отчет о новом поступлении зверей с ошибкой, в результате которой некоторые данные не расшифровались
# Расшифруйте данные. Определите, в какой клетке находится лев. Номер клетки совпадает с номером строки
def decoder(data_list, alphabet, bit: int):
    count = 0
    for data in data_list:
        count += 1
        result = ''
        for index_data in range(0, len(data), bit):
            result += alphabet[int(data[index_data:index_data + bit], 2)]
        print(f"Строка {count}: {result}")

def task2():
    lst = ['010100001100001001010011001011000000',
           '000001011100001011',
           '001011001111010011',
           '010010010011001111010001001111000111',
           '001100000101000010',
           '001011010001001111001100001001001011',
           '001101010100001100',
           '000001000000010001010010010100001011',
           '000011000101010000000000010001000100',
           '010010001111001101',
           '010010001111000001000000001011000000', 
           '011000001001000111']
    
    alphabet = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
    decoder(lst, alphabet, 6)
    